/**
  ******************************************************************************
  * @file    timer.c
  * @brief   基于KL46的计步器设计-定时器源程序
  * @author  赵守阳
  * @version V1.0
  * @date    2015.4.28
  * @note    
  ******************************************************************************
  */

#include "timer.h"

/**
 * \brief 时钟分加1，并处理时分单元
 *
 * \param[in] p : 时分秒数组头指针
 *
 * \return 无
 */
void minu_add1(uint_8 *p)
{
     *(p+1) += 1;            /* 分 + 1  */
     if(*(p+1) >= 60)        /* 分溢出        */
     {
         *(p+1) = 0;         /* 清分            */
         *p += 1;            /* 时 + 1  */
         if(*p >= 24)        /* 时溢出        */
         {
             *p = 0;         /* 清时           */
         }
     }
}


